In [13]:
import pandas as pd
import numpy as np

In [14]:
selloutData =pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [15]:
selloutData.head(1)

  REGIONID   PRODUCT  YEARWEEK   QTY
0      A60  PRODUCT4    201402  71.0

In [40]:
selloutData["NEW_QTY"] = np.where(selloutData["QTY"]<0 ,0, selloutData["QTY"])

In [41]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK    YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014.0
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014.0
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014.0
3      A60  PRODUCT47    201402      0.0      0.0     2  2014.0
4      A60  PRODUCT56    201402     23.0     23.0     2  2014.0

#### 53주차 제거

In [36]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY       int32
WEEK          int64
YEAR        float64
dtype: object

In [37]:
selloutData["WEEK"] = selloutData["YEARWEEK"]%100

### yearValue는 YEARWEEK에서 YEAR만 분리한 값(함수 만들어서 분리하기)

##### 함수 만들기

In [73]:
def customFuntion(inputColumn):
    inputColumn =201601
    yearValue =inputColumn/100
    yearValue = int(yearValue)
    return yearValue

##### YEAR 컬럼 만들고 위 함수 적용하기

In [44]:
selloutData["YEAR"] =selloutData["YEARWEEK"].apply(customFuntion)

In [45]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2016
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2016
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2016
3      A60  PRODUCT47    201402      0.0      0.0     2  2016
4      A60  PRODUCT56    201402     23.0     23.0     2  2016

##### 1) round함수 /가 아니고 // 하면 소숫점 아래자리가 반올림되어 정수형으로 변화 ( 근데 round함수는 반올림을 하기 때문에 50주차 이상이되면 반올림이 되어 연수가 올라가기 때문에 적합하지 않은 방법임)

In [69]:
selloutData["YEAR"] = round(selloutData["YEARWEEK"]//100)

In [115]:
refinedData = selloutData[selloutData.WEEK < 53]

In [116]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

##### 2 )따라서 int형으로 형 변환을 해주는 게 적합한 방법임

In [143]:
refinedData = selloutData[selloutData.YEARWEEK%100 < 53]

In [144]:
refinedData["TEST"] = ((selloutData["YEARWEEK"]/100).astype(int))

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [142]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR  TEST
0      A60   PRODUCT4    201402     71.0     71.0     2  2014  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014  2014

###  깰끔~ 해보이기 위해서 정렬!

In [120]:
sortKey = ["REGIONID","PRODUCT", "YEARWEEK"]

In [121]:
sortedData = refinedData.sort_values(sortKey)

In [122]:
sortedData.head()

     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  TEST
298       A00  PRODUCT34    201401  661.0    661.0     1  2014  2014
1757      A00  PRODUCT34    201402  679.0    679.0     2  2014  2014
3125      A00  PRODUCT34    201403  578.0    578.0     3  2014  2014
205       A00  PRODUCT34    201404  532.0    532.0     4  2014  2014
4369      A00  PRODUCT34    201405  516.0    516.0     5  2014  2014

##### 여기서 앞 줄 인덱스가 걸리적 거린다면

In [134]:
step1Data =sortedData.reset_index()

In [124]:
step1Data.head()

   index REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  TEST
0    298      A00  PRODUCT34    201401  661.0    661.0     1  2014  2014
1   1757      A00  PRODUCT34    201402  679.0    679.0     2  2014  2014
2   3125      A00  PRODUCT34    201403  578.0    578.0     3  2014  2014
3    205      A00  PRODUCT34    201404  532.0    532.0     4  2014  2014
4   4369      A00  PRODUCT34    201405  516.0    516.0     5  2014  2014

##### 또는 ..

In [154]:
step1Data =sortedData.reset_index(drop=True)

In [153]:
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  TEST
0      A00  PRODUCT34    201401  661.0    661.0     1  2014  2014
1      A00  PRODUCT34    201402  679.0    679.0     2  2014  2014
2      A00  PRODUCT34    201403  578.0    578.0     3  2014  2014
3      A00  PRODUCT34    201404  532.0    532.0     4  2014  2014
4      A00  PRODUCT34    201405  516.0    516.0     5  2014  2014

In [158]:
step1Data =sortedData.reset_index(drop=False)
step1Data.head()

   index REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  TEST
0    298      A00  PRODUCT34    201401  661.0    661.0     1  2014  2014
1   1757      A00  PRODUCT34    201402  679.0    679.0     2  2014  2014
2   3125      A00  PRODUCT34    201403  578.0    578.0     3  2014  2014
3    205      A00  PRODUCT34    201404  532.0    532.0     4  2014  2014
4   4369      A00  PRODUCT34    201405  516.0    516.0     5  2014  2014

### rolling 함수 사용하기!! (정렬을 하고 사용해야 함)

### 1.기본 이동평균 함수

In [159]:
step1Data["MA"]=step1Data.NEW_QTY.rolling(window=15, center=True).mean()

In [160]:
step1Data.head()

   index REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR  TEST  MA
0    298      A00  PRODUCT34    201401  661.0    661.0     1  2014  2014 NaN
1   1757      A00  PRODUCT34    201402  679.0    679.0     2  2014  2014 NaN
2   3125      A00  PRODUCT34    201403  578.0    578.0     3  2014  2014 NaN
3    205      A00  PRODUCT34    201404  532.0    532.0     4  2014  2014 NaN
4   4369      A00  PRODUCT34    201405  516.0    516.0     5  2014  2014 NaN

#### 위에서 NAN을 없애려면 어떻게 해야 할까?

##### min_period 이용--rolling함수:이동평균 구하는 함수, 
##### 해석 : (window=15:총 15개의 이동평균을 구하겠다, center=true: 내 자신을 7번째로, 즉 가운데로 놓고 이동평균을 구하겠다, min_periods =1 : 원래는 평균이 15개의 값을 구해야 하지만 최소로 1개 있을 때도 평균을 구하겠다, .mean()는 평균을 구하겠다-> .max(), .min()등으로 사용에 따라 변경 가능 )

In [161]:
step1Data["MA"] = step1Data.NEW_QTY.rolling(
    window=15, center=True, min_periods =1).mean()

In [162]:
step1Data.head()

,index,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,TEST,MA
0,298,A00,PRODUCT34,201401,661.0,661.0,1,2014,2014,520.000000
1,1757,A00,PRODUCT34,201402,679.0,679.0,2,2014,2014,514.444444
2,3125,A00,PRODUCT34,201403,578.0,578.0,3,2014,2014,516.800000
3,205,A00,PRODUCT34,201404,532.0,532.0,4,2014,2014,503.363636
4,4369,A00,PRODUCT34,201405,516.0,516.0,5,2014,2014,490.750000

#### result라는 csv 파일로 ./ 현재 경로에 저장하는 명령어

In [163]:
step1Data.to_csv("./result.csv")

In [164]:
pwd

'C:\\Users\\SMART-12\\Python_Fintech\\4.04 Project Seasonality'

In [165]:
groupKey = ["REGIONID","PRODUCT","YEAR"]